Repository: ead3471/eng_converter_bot
Catalog: locales/*/LC_MESSAGES/bot.po
Languages: ru

source: Hello, {user}! I'm a engineering units converter bot. Supported commands: - /start back to this point - /cstart start measure type choosing - /lang - set language
ru: Привет, {user}! Я бот - конвертер физических величин Поддерживаемые команды: - /start - вернутся в начало - /cstart - выбрать тип измерения - /lang - установить язык

source: Choose measure type:
ru: Выбери тип измерения

source: Select your preferred language
ru: Выбери предпочитаемый язык

source: Language is changed to {locale_name}
ru: Язык изменен на {locale_name}

source: {measure_type} is selected. Specify the measured value.
ru: {measure_type} выбрано Укажи значение для конвертации

source: Specify measure units please.
ru: Укажи единицы измереня конвертируемого значения

source: The value must be a number!
ru: Значение должно быть числом!

source: Set physical measure scale low
ru: Укажи нижнюю границу измеряемого значения

source: Current value is {current} Select new measure units please.
ru: Конвертируемое значение {current} Укажи новые единицы измерения.

source: Set physical value scale hi
ru: Укажи верхнюю границу измеряемого значения

source: Set physical value eu
ru: Укажи единицы измерения измеряемого значения

source: {measure} is equal to {converted}
ru: {measure} равно {converted}

source: Temperature
ru: Температура

source: Pressure
ru: Давление

source: Mass Flow
ru: Массовый расход

source: Thermoresistor
ru: Термосопротивление

source: Analogue Measure
ru: Аналоговое измерение

source: To the beginning
ru: К началу

source: Pa
ru: Па

source: kPa
ru: кПа

source: MPa
ru: МПа

source: kgf/sm2
ru: кгс/см²

source: kgf/m2
ru: кгс/м²

source: mm.water.column
ru: мм. H₂O

source: m.water.column
ru: м. H₂O

source: mm.hg.column
ru: мм. Hg

source: bar
ru: бар

source: atm physical
ru: физ. атмосферы

source: atm technical
ru: техн. атмосфер

source: kg/h
ru: кг/ч

source: kg/d
ru: кг/д

source: kg/s
ru: кг/с

source: t/h
ru: т/ч

source: t/s
ru: т/с

source: 4-20 mA
ru: 4-20 мА

source: 1-5 V
ru: 1-5 В

source: Physical units
ru: Физ. ед. изм
